In [11]:
import numpy as np
import pandas as pd
import random
import string

In [13]:
data_dir = 'dummy_data/'
og_data_dir = '../Data Files/'

LOWER_LETTERS = string.ascii_lowercase
UPPER_LETTERS = string.ascii_uppercase
DIGITS = string.digits

## Customer

In [99]:
customers = pd.DataFrame(columns=['id', 'name', 'contact_name', 'title', 'postal_code', 'country', 'contact'])

In [100]:
dummy_customer = pd.read_excel(data_dir + "dummy_customer_data.xlsx")

In [101]:
dummy_customer.head()

           name     contact_name      country
0    Ridgestone  Keelan Whiteley    Argentina
1  Mountaincast     Tayah Farley      Armenia
2     Ravengate  Akeel Cervantes    Australia
3      Redtales    Yasser Little      Austria
4    Petalwares      Simona Cook  The Bahamas

In [102]:
dummy_customer.shape

(490, 3)

In [103]:
for col in dummy_customer.columns:
    print(f"In {col} number of duplicated values: {dummy_customer.duplicated(col).sum()}")

In name number of duplicated values: 0
In contact_name number of duplicated values: 0
In country number of duplicated values: 409

In [104]:
# Title list
title_choice = ['Accounting Manager', 'Assistant Sales Agent', 'Marketing Assistant', 'Order Administrator', 'Owner', 'Owner/Marketing Assistant', 'Sales Agent', 'Sales Associate', 'Sales Manager', 'Sales Representative']

In [105]:
# Country List (Without any missing values)
country_list = dummy_customer.country[dummy_customer.country.notnull()]

In [106]:
# Populate name and contact_name
customers['name'] = dummy_customer.name.copy()
customers['contact_name'] = dummy_customer.contact_name.copy()

# Create random id's
customers['id'] = [''.join(random.choice(UPPER_LETTERS) for j in range(5)) for i in range(490)]

# Choose random title
customers['title'] = [random.choice(title_choice) for i in range(customers.shape[0])]

# Choose random country
customers['country'] = [random.choice(country_list) for i in range(customers.shape[0])]

In [107]:
# Create random postal_code
postal_list = list()
for row in range(customers.shape[0]):
    length = np.random.randint(5,9)
    code = ''
    for index in range(length):
        random_number = np.random.randint(10)
        if random_number < 5:
            code += random.choice(UPPER_LETTERS)
        else:
            code += random.choice(DIGITS)
    postal_list.append(code)

customers['postal_code'] = postal_list

In [108]:
# Create contact
customers['contact'] = [np.random.randint(1000000000, 9999999999) for i in range(customers.shape[0])]

In [109]:
customers.head()

,id,name,contact_name,title,postal_code,country,contact
0,LFIFD,Ridgestone,Keelan Whiteley,Owner,2KXF45N,Turkey,4855979087
1,MDQRO,Mountaincast,Tayah Farley,Sales Associate,ZK7CAAIO,"Korea, North",3997597663
2,BBHBT,Ravengate,Akeel Cervantes,Sales Agent,9T2S0,Iran,4063470845
3,FOZJG,Redtales,Yasser Little,Assistant Sales Agent,LNF5ME4,Russia,6069715154
4,WTOMS,Petalwares,Simona Cook,Sales Manager,MC5I3Y,Netherlands,4642304938

In [110]:
# Read the original customers csv
og_customers = pd.read_csv(og_data_dir + 'customers.csv')

In [111]:
# Concatenate dummy and original data
new_customers = pd.concat((og_customers, customers))

In [112]:
for col in new_customers.columns:
    print(f"In {col} number of duplicated values: {new_customers.duplicated(col).sum()}")

In id number of duplicated values: 0
In name number of duplicated values: 0
In contact_name number of duplicated values: 0
In title number of duplicated values: 569
In postal_code number of duplicated values: 5
In country number of duplicated values: 498
In contact number of duplicated values: 0

In [113]:
new_customers.shape

(581, 7)

In [114]:
new_customers.to_csv("new_customer.csv")

In [115]:
new_customers

,id,name,contact_name,title,postal_code,country,contact
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,12209,Germany,030-0074321
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,5021,Mexico,(5) 555-4729
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,5023,Mexico,(5) 555-3932
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,WA1 1DP,UK,(171) 555-7788
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,S-958 22,Sweden,0921-12 34 65
...,...,...,...,...,...,...,...
485,NZIMP,Liondale,Mahad Weston,Sales Agent,VW377W5,Croatia,7664874933
486,MWZZX,Zunsaois,Tevin Dougherty,Owner/Marketing Assistant,6A906H,Croatia,9049944685
487,QIDAR,Micromedia,Kien Robbins,Assistant Sales Agent,55J0R1A,Argentina,1763282379
488,UNRNZ,Beewater,Ziva Barnes,Owner,028O7,"Korea, South",6475923285
489,SVQTG,Happypoint,Tabitha Kenny,Assistant Sales Agent,32RBCGET,South Africa,8784310974

## Employees

In [116]:
employee = pd.DataFrame(columns=['id', 'last_name', 'first_name', 'title', 'birthdate', 'hire_date', 'postal_code', 'country', 'contact', 'reports_to'])

In [117]:
dummy_employee = pd.read_excel(data_dir + "dummy_employee_data.xlsx")

In [118]:
dummy_employee.head()

  first_name   last_name
0     Gunnar  Fitzgerald
1      Daisy        King
2      Lesly     Esparza
3     Shiloh     Merritt
4      Elian    Mcmillan

In [119]:
# Set first and last name
employee['first_name'] = dummy_employee.first_name
employee['last_name'] = dummy_employee.last_name

In [120]:
employee.shape

(136, 10)

In [121]:
# Create random postal_code
postal_list = list()
for row in range(employee.shape[0]):
    length = np.random.randint(5,7)
    code = ''
    for index in range(length):
        random_number = np.random.randint(10)
        if random_number < 3:
            code += random.choice(UPPER_LETTERS)
        else:
            code += random.choice(DIGITS)
    postal_list.append(code)

employee['postal_code'] = postal_list

In [124]:
# Choose random country
employee['country'] = [random.choice(country_list) for i in range(employee.shape[0])]

In [126]:
# Create contact
employee['contact'] = [np.random.randint(1000000000, 9999999999) for i in range(employee.shape[0])]

In [128]:
# Create ID
employee['id'] = [i+1 for i in range(employee.shape[0])]

In [153]:
from datetime import datetime, date, timedelta
from dateutil.relativedelta import relativedelta

In [148]:
# Create birthdate
start_date = date(1948,1,1)
end_date = date(1999,12,31)

time_between_dates = end_date - start_date
days_between_dates = time_between_dates.days

birth_date = list()
for i in range(employee.shape[0]):
    random_number_of_days = random.randrange(days_between_dates)
    birth_date.append(start_date + timedelta(days=random_number_of_days))

employee['birthdate'] = birth_date

In [157]:
# Create hiredate
hire_date = list()
for index in range(employee.shape[0]):
    year = np.random.randint(20,30)
    month = random.choice(range(1,12))
    
    if month in [1,3,5,7,8,10,12]:
        day = random.choice(range(1,31))
    elif month in [4,6,9,11]:
        day = random.choice(range(1,30))
    else:
        day = random.choice(range(1,28))
    
    start = employee.birthdate.iloc[index]
    
    hire = start + relativedelta(years=year, months=month, days=day)
    hire_date.append(hire)

employee['hire_date'] = hire_date

In [165]:
# Create title
employee_title_dict = {
    'Sales Representative': 100, 
    'Vice President, Sales': 1,
    'Sales Manager': 25, 
    'Inside Sales Coordinator': 10
}
    
title_list = list()

for index in range(employee.shape[0]):
    title = random.choice(list(employee_title_dict.keys()))
    title_list.append(title)
    
    employee_title_dict[title] -= 1
    if employee_title_dict[title] == 0:
        del employee_title_dict[title]

employee['title'] = title_list

In [185]:
employee[employee.title == 'Vice President, Sales']['id'].values[0]

7

In [202]:
# Create reports_to
reports_to_list = list()

# SM -> VP, ISC -> VP
employee.reports_to = np.where([True if title in ['Sales Manager', 'Inside Sales Coordinator'] else False for title in employee.title], 
                               employee[employee.title == 'Vice President, Sales'].id.values[0],
                               np.nan)

In [214]:
sm_id_list = list(employee[employee.title == 'Sales Manager'].id.values) * 4
random.shuffle(sm_id_list)

# SR -> SM
employee.loc[employee.title == 'Sales Representative', 'reports_to'] = sm_id_list

In [219]:
employee.reports_to.value_counts()

7.0     35
20.0     4
21.0     4
47.0     4
13.0     4
45.0     4
26.0     4
27.0     4
4.0      4
5.0      4
62.0     4
46.0     4
61.0     4
58.0     4
63.0     4
31.0     4
41.0     4
36.0     4
42.0     4
3.0      4
34.0     4
28.0     4
19.0     4
65.0     4
30.0     4
50.0     4
Name: reports_to, dtype: int64

In [218]:
employee

,id,last_name,first_name,title,birthdate,hire_date,postal_code,country,contact,reports_to
0,1,Fitzgerald,Gunnar,Sales Representative,1956-08-04,1985-09-18,907R02,Iceland,5514625394,20.0
1,2,King,Daisy,Sales Representative,1992-06-26,2017-04-22,M5388A,United Arab Emirates,1622590717,63.0
2,3,Esparza,Lesly,Sales Manager,1954-09-23,1975-01-13,2F365L,Turkey,1758615552,7.0
3,4,Merritt,Shiloh,Sales Manager,1957-05-11,1984-11-01,27TM3,Argentina,2042725721,7.0
4,5,Mcmillan,Elian,Sales Manager,1986-12-27,2012-05-26,4586R,Germany,6513191729,7.0
...,...,...,...,...,...,...,...,...,...,...
131,132,Keith,Dax,Sales Representative,1972-04-15,1995-10-21,89A7H,Denmark,4412148230,46.0
132,133,Tucker,Octavio,Sales Representative,1991-07-04,2020-01-15,798AC,Canada,8008406936,27.0
133,134,Mcclain,Ronald,Sales Representative,1996-09-02,2024-07-30,4U76Q2,Mongolia,2132757860,3.0
134,135,Farley,Anup,Sales Representative,1973-04-14,2000-03-10,0LI74,Israel,3181916100,19.0
135,136,Pokemon,Pushkaraj,Sales Representative,1974-06-02,2000-08-26,SW152,Belgium,3470646725,26.0

In [221]:
employee.to_csv("../Data Files/new_data/" + "new_employee.csv")

## Employee Territory

In [222]:
emp_territory = pd.DataFrame(columns=['employee_id', 'territory_id'])

In [241]:
dummy_emp_territory = pd.read_csv("../Data Files/new_data/" + "territories.csv", encoding='latin1')

In [242]:
dummy_emp_territory.head()

      id              name
0  94037         Mariehamn
1  34104            Tirana
2  25893  Andorra la Vella
3  95852            Vienna
4  76999             Minsk

In [243]:
dummy_emp_territory.shape

(240, 2)

In [ ]:
    df = pd. DataFrame([[1, 2], [3, 4]], columns = ["a", "b"])
    print(df)
    to_append = [5, 6]
    a_series = pd. Series(to_append, index = df. columns)
    df = df. append(a_series, ignore_index=True)
    print(df)

In [247]:
# Create 
territories_id_list = list(dummy_emp_territory.id.values)
terr_id_list = list()

# Each employee gets 1 territory
for emp_id in list(employee.id.values):
    terr_id = random.choice(territories_id_list)
    terr_id_list.append(terr_id)
    territories_id_list.remove(terr_id)

emp_territory['employee_id'] = list(employee.id.values)
emp_territory['territory_id'] = terr_id_list

# Randomly assign remainging territories to employees
for terr_id in territories_id_list:
    rand_emp_id = random.choice(list(employee.id.values))
    series = pd.Series([rand_emp_id, terr_id], index=emp_territory.columns)
    emp_territory = emp_territory.append(series, ignore_index=True)

In [253]:
emp_territory = emp_territory.sample(frac=1).reset_index(drop=True)
emp_territory.to_csv("../Data Files/new_data/new_employee_territories.csv", index=False)

## Supplier

In [254]:
supplier = pd.DataFrame(columns=['id', 'company_name', 'contact_name', 'contact_title', 'postal_code', 'country', 'contact'])

In [255]:
# Create ID
supplier['id'] = list(range(1,61))

# Create country
supplier['country'] = [random.choice(country_list) for i in range(supplier.shape[0])]

# Create contact
supplier['contact'] = [np.random.randint(1000000000, 9999999999) for i in range(supplier.shape[0])]

In [256]:
# Create random postal_code
postal_list = list()
for row in range(supplier.shape[0]):
    length = np.random.randint(4,7)
    code = ''
    for index in range(length):
        random_number = np.random.randint(10)
        if random_number < 4:
            code += random.choice(UPPER_LETTERS)
        else:
            code += random.choice(DIGITS)
    postal_list.append(code)

supplier['postal_code'] = postal_list

In [258]:
supp_title_list = ['Purchasing Manager', 'Order Administrator', 'Sales Representative', 'Marketing Manager', 'Export Administrator', 'Marketing Representative',
                   'Sales Agent', 'Sales Manager', 'International Marketing Mgr.', 'Coordinator Foreign Markets', 'Regional Account Rep.', 'Wholesale Account Agent', 
                   'Owner', 'Accounting Manager', 'Product Manager']

In [261]:
dummy_supplier = pd.read_excel(data_dir + "dummy_supplier_data.xlsx")

In [262]:
# Create company and contact name
supplier['company_name'] = dummy_supplier.company_name
supplier['contact_name'] = dummy_supplier.contact_name

In [264]:
# Create Title
supplier['contact_title'] = [random.choice(supp_title_list) for index in range(supplier.shape[0])]

In [265]:
supplier.head()

,id,company_name,contact_name,contact_title,postal_code,country,contact
0,1,Exotic Liquids,Richard Dixon (Dick),Product Manager,4331,Sri Lanka,2511188235
1,2,New Orleans Cajun Delights,Mina Dixon,Marketing Representative,7519U,Dominican Republic,5611256723
2,3,Grandma Kelly's Homestead,Vishnu Dixon,Export Administrator,1A921,Sweden,8698859257
3,4,Tokyo Traders,Eric Dixon,Coordinator Foreign Markets,0348,Estonia,1550304108
4,5,Cooperativa de Quesos 'Las Cabras',Harry Dixon,Marketing Representative,BY68T,Philippines,8655130479

In [266]:
# Save
supplier.to_csv("../Data Files/new_data/new_supplier.csv", index=False)

## Products

In [313]:
products = pd.DataFrame(columns=['id', 'name', 'supplier_id', 'category_id', 'quantity_per_unit', 'unit_price', 'stock', 'discontinued'])

In [314]:
dummy_products = pd.read_excel(data_dir + "dummy_product_name.xlsx")

In [315]:
cat_desc = pd.read_csv('../Data Files/new_data/categories_description.csv')

In [316]:
# Create name column
products['name'] = dummy_products.name

In [317]:
# Create id
products['id'] = [index for index in range(1, products.shape[0]+1)]

In [318]:
supp_id = list(supplier['id'].values)
cat_id = list(cat_desc['category_id'].values)

In [319]:
supplier_id_random = list()
cat_id_random = list()
qpu = list()
up = list()
stck_list = list()
discontinued = list()

In [320]:
# Randomly assign remainging column values

for index in range(products.shape[0]):
    supplier_id_random.append(random.choice(supp_id))
    cat_id_random.append(random.choice(cat_id))
    
    qpu.append(np.random.randint(1,80))
    up.append(np.random.randint(5,200))
    stck_list.append(np.random.randint(0,200))
    
    if index % 100 == 0:
        discontinued.append(True)
    else:
        discontinued.append(False)

In [321]:
products['supplier_id'] = supplier_id_random
products['category_id'] = cat_id_random
products['quantity_per_unit'] = qpu
products['unit_price'] = up
products['stock'] = stck_list
products['discontinued'] = discontinued

In [322]:
products.head()

,id,name,supplier_id,category_id,quantity_per_unit,unit_price,stock,discontinued
0,1,"HUMMUS, SABRA CLASSIC",21,11,78,60,135,True
1,2,Hummus,48,10,77,29,198,False
2,3,"HUMMUS, OTHER",54,5,77,139,56,False
3,4,Hummus - NFY12140O,59,9,57,115,37,False
4,5,Hummus - NFY12140P,50,5,79,24,109,False

In [324]:
products.isnull().sum()

id                   0
name                 0
supplier_id          0
category_id          0
quantity_per_unit    0
unit_price           0
stock                0
discontinued         0
dtype: int64

In [325]:
# Save
products.to_csv("../Data Files/new_data/new_products.csv", index=False)

## Order

In [364]:
order = pd.DataFrame(columns=['id', 'customer_id', 'employee_id', 'order_date', 'delivery_date', 'shipped_date', 'shipper_id', 'weight', 'ship_name', 'ship_postal_code', 'ship_country'])

In [352]:
order_postal = pd.read_csv("../Data Files/new_data/new_postal_address_lookup.csv")
shipper = pd.read_csv("../Data Files/new_data/shippers.csv")
og_order = pd.read_csv("../Data Files/orders.csv")

In [365]:
postal_code = list(order_postal.postal_code.values)
country = list(order_postal.country.values)
emp_id = list(employee.id.values)
ship_id = list(shipper.id.values)
cust_id = list(new_customers.id.values)
ship_name = list(og_order.ship_name.values)

In [366]:
for index in range(1,10000+1):
    cID = random.choice(cust_id)
    eID = random.choice(emp_id)

    random_number_of_days = random.randrange(days_between_dates)
    oDATE = start_date + timedelta(days=random_number_of_days)
    
    random_days_ship = np.random.randint(2,30)
    sDATE = oDATE + relativedelta(days=random_days_ship)
    
    if index%100 == 0:
        random_days_dev = np.random.randint(1,2)
        dDATE = sDATE + relativedelta(days=-random_days_dev)
    else:
        random_days_dev = np.random.randint(1,5)
        dDATE = sDATE + relativedelta(days=random_days_dev)
    
    sID = random.choice(ship_id)
    
    weight = np.random.random() * np.random.randint(100, 150)
    sNAME = random.choice(ship_name)
    
    row = order_postal.sample()
    sPOSTAL = row.postal_code.values[0]
    country_name = row.country.values[0]
    # order_postal.sample().postal_code.values[0]
    # sPOSTAL = random.choice((postal_code, country))
    # idx = postal_code.index(sPOSTAL)
    # country_name = country[index]

    series = pd.Series([index, cID, eID, oDATE, dDATE, sDATE, sID, weight, sNAME, sPOSTAL, country_name], index=order.columns)
    order = order.append(series, ignore_index=True)

In [368]:
order.head()

,id,customer_id,employee_id,order_date,delivery_date,shipped_date,shipper_id,weight,ship_name,ship_postal_code,ship_country
0,1,VRXDN,17,1951-03-04,1951-03-25,1951-03-24,6,41.854798,White Clover Markets,G9Q1P,Russia
1,2,UBEEV,43,1956-05-07,1956-06-06,1956-06-02,5,117.557225,Piccolo und mehr,M491P,United Kingdom
2,3,WILMK,131,1996-10-30,1996-11-10,1996-11-08,6,54.940937,Océano Atlántico Ltda.,C1PC141U,United Arab Emirates
3,4,PHZIR,120,1971-03-18,1971-04-14,1971-04-10,3,89.410684,Save-a-lot Markets,8H13P,Romania
4,5,USJMB,106,1964-11-02,1964-11-29,1964-11-26,6,10.998022,Hanari Carnes,30JV62KB,Chile

In [369]:
# Save
order.to_csv("../Data Files/new_data/new_order.csv", index=False)

## Order details

In [371]:
order_details = pd.DataFrame(columns=['order_id', 'product_id', 'unit_price', 'quantity', 'discount'])

In [370]:
order_IDS = list(order.id.values)
products_IDS = list(products.id.values)

In [377]:
for index, order_id_value in enumerate(order_IDS):
    for i in range(np.random.randint(1,5)):
        prod_id = random.choice(products_IDS)
        up = np.random.randint(5,200)
        quanti = np.random.randint(5, 100)
        
        if (index+i)%250 == 0:
            dis = round(np.random.uniform(0,0.5), 2)
        else:
            dis = 0
        series = pd.Series([order_id_value, prod_id, up, quanti, dis], index=order_details.columns)
        order_details = order_details.append(series, ignore_index=True)

In [379]:
order_details.head()

   order_id  product_id  unit_price  quantity  discount
0       1.0      8994.0       134.0      57.0      0.19
1       2.0      5851.0        46.0      87.0      0.00
2       3.0     10312.0       156.0      15.0      0.00
3       3.0      5309.0        16.0      28.0      0.00
4       4.0      4133.0       143.0      71.0      0.00

In [380]:
# Save
order_details.to_csv("../Data Files/new_data/new_order_details.csv", index=False)

In [378]:
order_details.shape

(25083, 5)

## Postal code

In [381]:
from glob import glob

In [410]:
of_post_code = pd.read_csv('../Data Files/new_data/post_address_lookup_old.csv', dtype='object')

In [413]:
of_post_code

    postal_code             country       city
0          4331           Sri Lanka      Tokyo
1         7519U  Dominican Republic      Delhi
2         1A921              Sweden   Shanghai
3           348             Estonia      Dhaka
4         BY68T         Philippines  Sao Paulo
..          ...                 ...        ...
768     VW377W5             Croatia  Sheffield
769      6A906H             Croatia   Kumamoto
770     55J0R1A           Argentina     Yan'an
771       028O7        Korea, South    Maturin
772    32RBCGET        South Africa   Tongliao

[773 rows x 3 columns]

In [415]:
post_code = pd.DataFrame(columns=['postal_code', 'country'])
for filepath in glob('../Data Files/new_data/*.csv'):
    print(filepath)
    if filepath.split('/')[-1].split('.')[0] in ['supplier','employees', 'customers']:
        temp = pd.read_csv(filepath, dtype='object')
        post_code = post_code.append(temp[['postal_code', 'country']], ignore_index=True) 
    elif filepath.split('/')[-1].split('.')[0] in ['orders']:
        temp = pd.read_csv(filepath, dtype='object')
        post_code = post_code.append(temp[['ship_postal_code', 'ship_country']].rename(columns={'ship_postal_code': 'postal_code', 'ship_country': 'country'}), ignore_index=True)

../Data Files/new_data/customers.csv
../Data Files/new_data/categories.csv
../Data Files/new_data/products.csv
../Data Files/new_data/employee_territories.csv
../Data Files/new_data/post_address_lookup_old.csv
../Data Files/new_data/orders.csv
../Data Files/new_data/supplier.csv
../Data Files/new_data/categories_description.csv
../Data Files/new_data/shippers.csv
../Data Files/new_data/territories.csv
../Data Files/new_data/employees.csv
../Data Files/new_data/post_address_lookup.csv
../Data Files/new_data/order_details.csv

In [416]:
post_code.drop_duplicates(inplace=True)
post_code.reset_index(drop=True, inplace=True)

In [417]:
post_code['city'] = of_post_code['city']

In [425]:
post_code.to_csv('../Data Files/new_data/post_address_lookup.csv', index=False)

In [422]:
post_code.loc[post_code.postal_code == '0348', 'city'] = 'Mumbai'

In [424]:
post_code.duplicated().sum()

0

In [434]:
employee.title.unique()

array(['Sales Representative', 'Sales Manager',
       'Inside Sales Coordinator', 'Vice President, Sales'], dtype=object)

In [437]:
sm = ['Sales Manager' for i in range(25)]
isc = ['Inside Sales Coordinator' for i in range(10)]
sr = ['Sales Representative' for i in range(100)]

In [438]:
title = ['Vice President, Sales'] + sm + isc + sr

In [440]:
employee.title = title

In [441]:
employee

,id,last_name,first_name,title,birthdate,hire_date,postal_code,country,contact,reports_to
0,1,Fitzgerald,Gunnar,"Vice President, Sales",1956-08-04,1985-09-18,907R02,Iceland,5514625394,20.0
1,2,King,Daisy,Sales Manager,1992-06-26,2017-04-22,M5388A,United Arab Emirates,1622590717,63.0
2,3,Esparza,Lesly,Sales Manager,1954-09-23,1975-01-13,2F365L,Turkey,1758615552,7.0
3,4,Merritt,Shiloh,Sales Manager,1957-05-11,1984-11-01,27TM3,Argentina,2042725721,7.0
4,5,Mcmillan,Elian,Sales Manager,1986-12-27,2012-05-26,4586R,Germany,6513191729,7.0
...,...,...,...,...,...,...,...,...,...,...
131,132,Keith,Dax,Sales Representative,1972-04-15,1995-10-21,89A7H,Denmark,4412148230,46.0
132,133,Tucker,Octavio,Sales Representative,1991-07-04,2020-01-15,798AC,Canada,8008406936,27.0
133,134,Mcclain,Ronald,Sales Representative,1996-09-02,2024-07-30,4U76Q2,Mongolia,2132757860,3.0
134,135,Farley,Anup,Sales Representative,1973-04-14,2000-03-10,0LI74,Israel,3181916100,19.0
135,136,Pokemon,Pushkaraj,Sales Representative,1974-06-02,2000-08-26,SW152,Belgium,3470646725,26.0

In [442]:
# SM -> VP, ISC -> VP
employee.reports_to = np.where([True if title in ['Sales Manager', 'Inside Sales Coordinator'] else False for title in employee.title], 
                               employee[employee.title == 'Vice President, Sales'].id.values[0],
                               np.nan)

In [443]:
sm_id_list = list(employee[employee.title == 'Sales Manager'].id.values) * 4

# SR -> SM
employee.loc[employee.title == 'Sales Representative', 'reports_to'] = sm_id_list

In [444]:
employee

,id,last_name,first_name,title,birthdate,hire_date,postal_code,country,contact,reports_to
0,1,Fitzgerald,Gunnar,"Vice President, Sales",1956-08-04,1985-09-18,907R02,Iceland,5514625394,NaN
1,2,King,Daisy,Sales Manager,1992-06-26,2017-04-22,M5388A,United Arab Emirates,1622590717,1.0
2,3,Esparza,Lesly,Sales Manager,1954-09-23,1975-01-13,2F365L,Turkey,1758615552,1.0
3,4,Merritt,Shiloh,Sales Manager,1957-05-11,1984-11-01,27TM3,Argentina,2042725721,1.0
4,5,Mcmillan,Elian,Sales Manager,1986-12-27,2012-05-26,4586R,Germany,6513191729,1.0
...,...,...,...,...,...,...,...,...,...,...
131,132,Keith,Dax,Sales Representative,1972-04-15,1995-10-21,89A7H,Denmark,4412148230,22.0
132,133,Tucker,Octavio,Sales Representative,1991-07-04,2020-01-15,798AC,Canada,8008406936,23.0
133,134,Mcclain,Ronald,Sales Representative,1996-09-02,2024-07-30,4U76Q2,Mongolia,2132757860,24.0
134,135,Farley,Anup,Sales Representative,1973-04-14,2000-03-10,0LI74,Israel,3181916100,25.0
135,136,Pokemon,Pushkaraj,Sales Representative,1974-06-02,2000-08-26,SW152,Belgium,3470646725,26.0

In [445]:
employee.to_csv("../Data Files/new_data/" + "employees.csv", index=False)